<%@ page contentType="text/html;charset=UTF-8" language="java" pageEncoding="UTF-8" %>
<html>
<%@ include file="/../include/head.jsp" %>
<body>
<div class="container">
    <%@ include file="/../include/menucashnew.jsp" %>
    <br>
    <pre>
    ----------------------------|----------------------------------------------------------
                                |  ЗАО "ТестБанк"
                                |  --------------------------------------------------------
                                |               (получатель платежа)
        ЗАО "ТестБанк"          |  Г.БРЕСТ ООО "Рога и копыта"
                                |          (наименование банка)            Код    TESTBY2X
                                |  Счет получателя ${userOperation.checkingAccount}
                                |                  ----------------------------------
    Зав. N     123456789        |
    Р/счет                      |
    ${userOperation.checkingAccount}|  УНП:123456789                  Номер операции ${userOperation.id}
    ${userOperation.timestamp}     |  -------------                                 --------
    Кассовый чек N ${userOperation.id}           |  ${userOperation.fio}
                                |   -----------------------------------------------------
                                |       (фамилия, собственное имя, отчество (при наличии)
                                |
                                |      ${userOperation.specification}
                                |   -------------------------------------------------------
                                |                       (описание)
                                |  --------------------------------------------------------
                                |  |  Вид  платежа     | Дата и время         |   Сумма   |
                                |  --------------------------------------------------------
                                |  |Коммунальные услуги|${userOperation.timestamp}<c:forEach items="${userEntriesList}" var="userEntriesList" >|${userEntriesList.sum}  |
                                |  |                   |-----------------------------------
                                |  |                   |   Пеня               |           |
                                |   --------------------                      -------------
                                |  Без НДС                               Всего|${userEntriesList.sum}</c:forEach>      |
             КВИТАНЦИЯ          |                                              ------------
    Кассир ${user.login}            |  Плательщик ___________
    ----------------------------|----------------------------------------------------------
</pre>
</div>
</body>
</html>
